Информационная_база/Catalogs/ШаблоныБинарныхДеревьев.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>ШаблоныБинарныхДеревьев</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>КонтролироватьВремя</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНаСдачу</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентДляСдачи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>1</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПеремешиватьВариантыОтветов</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТестирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Разделы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Разделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоВопросов</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Информационная_база/Enums/ТипыТестирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ТипыТестирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БинарноеДерево</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Плоское</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Информационная_база/Documents/ТестБинарноеДерево.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ТестБинарноеДерево</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Опрос</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НазначениеОпросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Респондент</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.Респондент</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаРедактирования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяНачалаТеста</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РедактируемыйРаздел</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Разделы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатСдачи</Name>
					<Type>
						<v8:Type>cfg:EnumRef.РезультатыСдачи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекущийУзелДерева</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлубинаДерева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВремяЗавершения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПроцентЗавершения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СреднееВремяОтвета</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОбщееВремяПрохождения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПравильныхОтветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоНеправильныхОтветов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальнаяГлубинаДерева</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МаксимальноеКоличествоВопросов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимОбучения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПоказыватьПодсказки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипТестирования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТестирования</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШаблонТеста</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ШаблоныБинарныхДеревьев</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ОтветыБинарногоДерева</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ответ</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ВопросыДляТестирования</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОткрытыйОтвет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УзелДерева</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляТестирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипОтветаБинарный</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОтветовБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяОтвета</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НомерШага</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяНаОтвет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВопросыБинарногоДерева</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>40</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раздел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Разделы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляТестирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтветПолучен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Правильность</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>1</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Проверен</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УзелДерева</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УровеньДерева</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипПерехода</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыПереходовБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПорядокПрохождения</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВремяВопроса</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусУзла</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтатусыУзловБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>СтруктураДереваТеста</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>УзелДерева</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РодительскийУзел</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УзлыБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипСвязи</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыОтветовБинарногоДерева</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вопрос</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ВопросыДляТестирования</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯвляетсяЛистом</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Активность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Информационная_база/Catalogs/ШаблоныБинарныхДеревьев/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
// Интерфейс для работы с подсистемой Печать.

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	
КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Групповое изменение объектов

// Возвращает список реквизитов, которые разрешается редактировать
// с помощью обработки группового изменения объектов.
//
Функция РеквизитыРедактируемыеВГрупповойОбработке() Экспорт
	
	РедактируемыеРеквизиты = Новый Массив;
	РедактируемыеРеквизиты.Добавить("Наименование");
	РедактируемыеРеквизиты.Добавить("КонтролироватьВремя");
	РедактируемыеРеквизиты.Добавить("ВремяНаСдачу");
	РедактируемыеРеквизиты.Добавить("ПроцентДляСдачи");
	РедактируемыеРеквизиты.Добавить("ПеремешиватьВариантыОтветов");
	РедактируемыеРеквизиты.Добавить("Разделы.*");
	Возврат РедактируемыеРеквизиты;
	
КонецФункции

//#КонецОбласти

//#КонецЕсли

//Для бинарного дерева
//Модуль менеджера "ТестБинарноеДерево"

#Область УправляемыйИнтерфейс

// Создает структуру бинарного дерева для шаблона
//
// Параметры:
//  Шаблон - СправочникСсылка.ШаблоныБинарныхДеревьев
//
Процедура СоздатьСтруктуруДерева(Шаблон) Экспорт
	
	// Получаем все вопросы по разделам шаблона
	Вопросы = ПолучитьВсеВопросыПоШаблону(Шаблон);
	Если Вопросы.Количество() = 0 Тогда
		ВызватьИсключение "Для шаблона не найдены вопросы";
	КонецЕсли;
	
	// Создаем корневой узел
	КорневойУзел = Справочники.УзлыБинарногоДерева.СоздатьЭлемент();
	КорневойУзел.Наименование = "Корневой узел";
	КорневойУзел.Вопрос = Вопросы[0];
	КорневойУзел.ЯвляетсяЛистом = Ложь;
	КорневойУзел.Записать();
	
	// Создаем начальную структуру дерева
	СоздатьНачальнуюСтруктуруДерева(Шаблон, КорневойУзел, Вопросы);
	
КонецПроцедуры

// Получает все вопросы по шаблону
//
// Параметры:
//  Шаблон - СправочникСсылка.ШаблоныБинарныхДеревьев
//
// Возвращаемое значение:
//   Массив - массив ссылок на вопросы
//
Функция ПолучитьВсеВопросыПоШаблону(Шаблон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РазделыВопросы.Вопрос
	|ИЗ
	|	Справочник.ШаблоныБинарныхДеревьев.Разделы КАК ШаблоныРазделы
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Разделы.Вопросы КАК РазделыВопросы
	|		ПО ШаблоныРазделы.Раздел = РазделыВопросы.Ссылка
	|ГДЕ
	|	ШаблоныРазделы.Ссылка = &Шаблон";
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	Результат = Запрос.Выполнить().Выгрузить();
	МассивВопросов = Новый Массив;
	
	Для Каждого Строка Из Результат Цикл
		МассивВопросов.Добавить(Строка.Вопрос);
	КонецЦикла;
	
	Возврат МассивВопросов;
	
КонецФункции

// Создает начальную структуру дерева
//
// Параметры:
//  Шаблон - СправочникСсылка.ШаблоныБинарныхДеревьев
//  КорневойУзел - СправочникСсылка.УзлыБинарногоДерева
//  Вопросы - Массив - доступные вопросы
//
Процедура СоздатьНачальнуюСтруктуруДерева(Шаблон, КорневойУзел, Вопросы)
	
	// Создаем несколько начальных узлов для демонстрации
	Если Вопросы.Количество() > 1 Тогда
		
		// Узел для ответа "Да"
		УзелДа = СоздатьУзелДерева("Узел Да", Вопросы[1], Ложь);
		ДобавитьСвязьВДерево(Шаблон, КорневойУзел, УзелДа, Перечисления.ТипыСвязейБинарногоДерева.Да);
		
		// Узел для ответа "Нет"  
		УзелНет = СоздатьУзелДерева("Узел Нет", Вопросы[2 % Вопросы.Количество()], Истина);
		ДобавитьСвязьВДерево(Шаблон, КорневойУзел, УзелНет, Перечисления.ТипыСвязейБинарногоДерева.Нет);
		
	КонецЕсли;
	
КонецПроцедуры

// Создает узел дерева
//
// Параметры:
//  Наименование - Строка
//  Вопрос - ПланВидовХарактеристик.ВопросыДляТестирования
//  ЯвляетсяЛистом - Булево
//
// Возвращаемое значение:
//   СправочникСсылка.УзлыБинарногоДерева
//
Функция СоздатьУзелДерева(Наименование, Вопрос, ЯвляетсяЛистом)
	
	Узел = Справочники.УзлыБинарногоДерева.СоздатьЭлемент();
	Узел.Наименование = Наименование;
	Узел.Вопрос = Вопрос;
	Узел.ЯвляетсяЛистом = ЯвляетсяЛистом;
	Узел.Записать();
	
	Возврат Узел;
	
КонецФункции

// Добавляет связь в дерево
//
// Параметры:
//  Шаблон - СправочникСсылка.ШаблоныБинарныхДеревьев
//  Родитель - СправочникСсылка.УзлыБинарногоДерева
//  Потомок - СправочникСсылка.УзлыБинарногоДерева
//  ТипСвязи - ПеречислениеСсылка.ТипыСвязейБинарногоДерева
//
Процедура ДобавитьСвязьВДерево(Шаблон, Родитель, Потомок, ТипСвязи)
	
	Запись = РегистрыСведений.СтруктураБинарногоДерева.СоздатьНаборЗаписей();
	НоваяЗапись = Запись.Добавить();
	НоваяЗапись.Шаблон = Шаблон;
	НоваяЗапись.Родитель = Родитель;
	НоваяЗапись.ТипСвязи = ТипСвязи;
	НоваяЗапись.Потомок = Потомок;
	Запись.Записать();
	
КонецПроцедуры


// Создает новый тест бинарного дерева
//
// Параметры:
//  Шаблон - СправочникСсылка.ШаблоныБинарныхДеревьев
//  Респондент - СправочникСсылка.Контакты
//
// Возвращаемое значение:
//   ДокументСсылка.ТестБинарноеДерево
//
Функция СоздатьТест(Шаблон, Респондент) Экспорт
	
	Тест = Документы.ТестБинарноеДерево.СоздатьДокумент();
	Тест.Шаблон = Шаблон;
	Тест.Респондент = Респондент;
	Тест.ДатаНачала = ТекущаяДата();
	//Тест.Опрос = Объект.Ссылка;
	Тест.ТипТестирования = Перечисления.ТипыТестирования.БинарноеДерево;
	Тест.Завершен = Ложь;
	
	// Находим корневой узел для данного шаблона
	КорневойУзел = НайтиКорневойУзел(Шаблон);
	Если КорневойУзел = Неопределено Тогда
		ВызватьИсключение "Для шаблона не найден корневой узел";
	КонецЕсли;
	
	Тест.ТекущийУзел = КорневойУзел;
	
	// Записываем первый вопрос
	ЗаписатьВопросТеста(Тест, КорневойУзел);
	
	Возврат Тест;
	
КонецФункции

// Находит корневой узел для шаблона
//
// Параметры:
//  Шаблон - СправочникСсылка.ШаблоныБинарныхДеревьев
//
// Возвращаемое значение:
//   СправочникСсылка.УзлыБинарногоДерева
//
Функция НайтиКорневойУзел(Шаблон)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	СтруктураДерева.Родитель
	|ИЗ
	|	РегистрСведений.СтруктураБинарногоДерева КАК СтруктураДерева
	|ГДЕ
	|	СтруктураДерева.Шаблон = &Шаблон
	|	И НЕ СУЩЕСТВУЕТ (ВЫБРАТЬ
	|			СтруктураДереваВложенный.Потомок
	|		ИЗ
	|			РегистрСведений.СтруктураБинарногоДерева КАК СтруктураДереваВложенный
	|		ГДЕ
	|			СтруктураДереваВложенный.Потомок = СтруктураДерева.Родитель
	|			И СтруктураДереваВложенный.Шаблон = &Шаблон)";
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Родитель;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Записывает вопрос в регистр вопросов теста
//
// Параметры:
//  Тест - ДокументСсылка.ТестБинарноеДерево
//  Узел - СправочникСсылка.УзлыБинарногоДерева
//
Процедура ЗаписатьВопросТеста(Тест, Узел)
	
	Запись = РегистрыСведений.ВопросыТестаБинарноеДерево.СоздатьНаборЗаписей();
	НоваяЗапись = Запись.Добавить();
	НоваяЗапись.Тест = Тест.Ссылка;
	НоваяЗапись.Узел = Узел;
	НоваяЗапись.Вопрос = Узел.Вопрос;
	НоваяЗапись.Порядок = ПолучитьСледующийПорядок(Тест);
	НоваяЗапись.ДатаВопроса = ТекущаяДата();
	Запись.Записать();
	
КонецПроцедуры

// Получает следующий порядковый номер для вопроса
//
// Параметры:
//  Тест - ДокументСсылка.ТестБинарноеДерево
//
// Возвращаемое значение:
//   Число
//
Функция ПолучитьСледующийПорядок(Тест)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	МАКСИМУМ(ВопросыТеста.Порядок) КАК МаксПорядок
	|ИЗ
	|	РегистрСведений.ВопросыТестаБинарноеДерево КАК ВопросыТеста
	|ГДЕ
	|	ВопросыТеста.Тест = &Тест";
	
	Запрос.УстановитьПараметр("Тест", Тест.Ссылка);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат ?(Результат.МаксПорядок = Неопределено, 1, Результат.МаксПорядок + 1);
	КонецЕсли;
	
	Возврат 1;
	
КонецФункции

// Находит следующий узел по ответу
//
// Параметры:
//  Шаблон - СправочникСсылка.ШаблоныБинарныхДеревьев
//  ТекущийУзел - СправочникСсылка.УзлыБинарногоДерева
//  Ответ - Булево
//
// Возвращаемое значение:
//   СправочникСсылка.УзлыБинарногоДерева
//
Функция НайтиСледующийУзел(Шаблон, ТекущийУзел, Ответ)
	
	ТипСвязи = ?(Ответ, 
		Перечисления.ТипыСвязейБинарногоДерева.Да,
		Перечисления.ТипыСвязейБинарногоДерева.Нет);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	СтруктураДерева.Потомок
	|ИЗ
	|	РегистрСведений.СтруктураБинарногоДерева КАК СтруктураДерева
	|ГДЕ
	|	СтруктураДерева.Шаблон = &Шаблон
	|	И СтруктураДерева.Родитель = &ТекущийУзел
	|	И СтруктураДерева.ТипСвязи = &ТипСвязи";
	
	Запрос.УстановитьПараметр("Шаблон", Шаблон);
	Запрос.УстановитьПараметр("ТекущийУзел", ТекущийУзел);
	Запрос.УстановитьПараметр("ТипСвязи", ТипСвязи);
	
	Результат = Запрос.Выполнить().Выбрать();
	Если Результат.Следующий() Тогда
		Возврат Результат.Потомок;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

// Получает историю вопросов и ответов теста
//
// Параметры:
//  Тест - ДокументСсылка.ТестБинарноеДерево
//
// Возвращаемое значение:
//   ТаблицаЗначений - история теста
//
Функция ПолучитьИсториюТеста(Тест) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВопросыТеста.Вопрос,
	|	ВопросыТеста.ДатаВопроса,
	|	Ответы.Ответ,
	|	Ответы.ДатаОтвета
	|ИЗ
	|	РегистрСведений.ВопросыТестаБинарноеДерево КАК ВопросыТеста
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ОтветыБинарноеДерево КАК Ответы
	|		ПО ВопросыТеста.Тест = Ответы.Тест
	|			И ВопросыТеста.Узел = Ответы.Узел
	|ГДЕ
	|	ВопросыТеста.Тест = &Тест
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВопросыТеста.Порядок";
	
	Запрос.УстановитьПараметр("Тест", Тест.Ссылка);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции

#КонецОбласти

#КонецОбласти

#КонецЕсли
